import 'package:bilimapp/features/books/data/models/books_model.dart';

List<BooksModel> booksData = [
  const BooksModel(
      id: "1",
      title: "Жамийла",
      category: 'Bestsellers',
      author: "Ч.Айтматов",
      description: [
        Description(
            data:
                '''Жамийля - Чыңгыз Айтматовдун биринчи көлөмдүү повести (1958). Повестте Данияр м-н Жамийланын махабаты боз улан бала Сейиттин айтуусунда берилет.

Айтматов "Жамийляны" Москвадагы Бүткүл дүйнөлүк М.Горький атындагы адабият институтунда жүргөн кезинде, Тверь саябанындагы батиринде жашаган кезде ак кагазга түшүргөн. Повесттин адегендеги аты “Обон” деп аталып, кыргызча ушул ат менен жарык көргөн. Орус тилинде “Новый мир” журналына (1958, № 8) “Жамийла” деген ат м-н жарык көрүп, дүйнө элдеринин тилдерине ушул ат менен белгилүү болгон.

Чыгармадагы окуянын лирика-романтикалык маанайда баяндалышынан улам повестти адабиятчылар “кара сөздөгү поэзия же прозадагы ыр” деп да атап жүрүшөт. Чындыгында да чыгарманын мазмундук өзөгүн түзгөн тема – сүйүү темасы: Жамийла м-н Даниярды табыштырган махабат; ошондой эле турмушка, элге, жерге, жашоого болгон чексиз сүйүү м-н адамдагы руханий сулуулукка болгон сүйүүнү, умтулууну бириктирген адамдык бакыбат зор сүйүүнүн Жамийладагы личносттук “мендин” патриархалдык салт-санаа, түшүнүк үстөмдүк кылган чөйрөдөгү үй-бүлө түшүнүгүнө кайчы келиши сыяктуу маселелер м-н тыгыз биримдикте каралат.

Автордун өз чыгармасын адегенде «Обон» деп аташы бекеринен эмес, анткени обон повесттин бүткүл сюжеттик-композициялык курулушунда чоң роль ойноп, анын негизги идеялык-көркөмдүк табиятын аныктап турат. Повесть жарык көргөндөн бери, өзгөчө өзүбүздүн улуттук адабий чөйрөбүздө Жамийланын Садыктан кетишине байланыштуу талаш пикирлер айтылып келет. Повесттин образдар системасын талдоодо «Садык Жамийланы сүйөт эле болчу, ал катты өз учурундагы эреже-жосундарга ылайык жазат, Жамийланын аны чанып, башкага кетүүсүнүн эч жүйөөсү жок, жеңил ойлуулук» деген пикирлер көп айтылды. Бул жерде кеп Садыкта эмес, Жамийлада, аны Даниярга жолуктурган тагдырда. Эгер көпчүлүктөн кескин айырмаланган мүнөзү, романтикалуу жандүйнөсү, августтун ажайып түндөрүндөгү керемет обондору м-н Данияр келбесе, Жамийла Садыкты күтүп, бара-бара чоң, кичине үйдү башкарган нарктуу кайнененин ордун басмак. Бирок көңүлгө канат байлап, мазмундуу жашоого умтулткан, күчтүү толкун болуп каптап келген сүйүүсүнөн баш тартып, ар кандай чектөөлөргө, адат-салтка баш ийип жашоо Жамийла сыяктуу күчтүү, бакыбат натурадагы аялга туура келмек эмес. Ошол себептүү ал акыры «эски шинели м-н тамтыгы чыккан өтүгүнөн башка эчтемеси жок» Даниярды «башын бийик көтөрүп, кылчайбай» ээрчип кетет.

Кийин сүрөтчү болгон Сейит да өмүр тарыхына жылуу из калтырган балалык учурга көп убакыт өткөндөн кийин кайрылып, андагы өзү күбө болгон сүйүү баянынын тазалыгына эч шек кылбай окурмандарга эскерип айтып берет. «Сүрөт тарткан боёктун ар бир сүрткөн сызыгынан Даниярдын обону угулсун! Сүрөт тарткан боёктун ар бир сүрткөн сызыгында Жамийланын жүрөк оту болсун!» деген художник-баяндоочу Сейиттин сөзү м-н повесть аяктайт. Повесттен, ошондой эле автордун сюжет куруу, сөз м-н иштөө чеберчилигинин өзүнчөлүгүн көрүүгө болот. Андагы портреттик, пейзаждык сүрөттөөлөр, көркөм сөз каражаттарынын ар бири чыгарманын идеялык-көркөмдүк системасында белгилүү бир маанилүү милдет аткарып, поэтикалык ойдун өсүш ыраатын шарттап турат.
'''),
      ],
      imageUrl: ImageFile(
          imageUrl:
              "https://bookhouse.kg/media/galleryphoto/2022/4/ccdc8cad-ee85-458e-b1e0-ba0e770e011d.jpeg.600x780_q94.jpg"),
      booksType: "New Books",
      booksPage: '300',
      publishedYear: '1998',
      rating: '4.5',
      reviews: '24,8k'),
  const BooksModel(
      id: "2",
      title: "Окуучу кыз",
      category: 'New Books',
      author: "Тара Вестовер",
      description: [
        Description(data: '''У Тары странная семья.
Отец готовится к концу света - консервирует персики на случай массового голода и скупает оружие, которым можно уничтожить целую деревню.
Мать лечит ожоги и раздробленные кости настойкой лаванды, а братья и сестры не ходят в школу и работают на свалке.
Тара знает, как обращаться с винтовкой и управлять строительным краном, но с трудом может читать и писать.
Но однажды ее жизнь меняется. Втайне от родителей Тара готовится к поступлению в колледж..
'''),
      ],
      imageUrl: ImageFile(
          imageUrl:
              "https://bookhouse.kg/media/galleryphoto/2021/4/41870930-0ac2-49a3-980a-59e1be80508d.jpg.360x460_q94.jpg"),
      booksType: "New Books",
      booksPage: '495',
      publishedYear: '2021',
      rating: '4.6',
      reviews: '30k'),
  const BooksModel(
      id: "3",
      title: '''Кылым карытар
бир күн ''',
      category: 'Bestsellers',
      author: "Ч.Айтматов",
      description: [
        Description(
            data:
                '''Роман СССР Мамлекеттик сыйлыгына татыктуу болгон. Ч. Айтматовдун бул романы  өзүнүн идеялык-тематикалык багыты, сюжеттик-композициялык түзүлүшү  боюнча  «Гүлсарат” повестине жакын.
'''),
      ],
      imageUrl: ImageFile(
          imageUrl:
              "https://bookhouse.kg/media/galleryphoto/2019/9/97ee183d-875c-4e11-991a-b6dd399b9029.jpg.360x460_q94.jpg"),
      booksType: "Bestsellers",
      booksPage: '440',
      publishedYear: '2019',
      rating: '4.8',
      reviews: '34k'),
  const BooksModel(
      id: "4",
      title: "Айбан чарба",
      category: 'Bestsellers',
      author: "Оруэлл Джордж",
      description: [
        Description(
            data:
                '''Бул каймана мааниде жазылган чыгарма диктаторлукту, анын кантип пайда болуп, кайра кантип өнүгүп жүрүп отурарын таасын чагылдырат. Чыгарма жаныбарлар тууралуу жазылгандыктан, балдардан тартып, чоңдорго чейин кызыктуу жана жалпы окурмандарга арналат
'''),
      ],
      imageUrl: ImageFile(
          imageUrl:
              "https://bookhouse.kg/media/galleryphoto/2022/2/4dbe0f30-b309-4c10-893b-49f05f6032d0.jpg.360x460_q94.jpg"),
      booksType: "New Books",
      booksPage: '152',
      publishedYear: '2022',
      rating: '4.5',
      reviews: '35k'),
  const BooksModel(
      id: "5",
      title: '''Бир өлкөнүн 
өнүгүү сырлары''',
      category: 'Bestsellers',
      author: "Григорий Петров",
      description: [
        Description(
            data:
                '''Бир өлкөнүн өтө кыйын кырдаалдан кантип чыкканы, кылымдар бою мүңкүрөгөн өлкө кантип өз мамлекеттүүлүгүнө жеткени, жоголуп бараткан тилин, дилин кантип сактап калганы жана бийик өнүгүүгө карай жол тапканы тууралуу сырлар камтылган абдан баалуу китеп колуңуздарда. Алдынкы кылымдын баштарында жазылган бул китеп дүйнөнүн көптөгөн тилдерине байма-бай которулуп келет. Түпкү аты «Финляндия страна белых лилий»
деп аталган бул китеп Ала-Тоо асыл мекенибиздин келечегине
кайдыгер карабаган ар бир Кыргыз жаранына арналат.
'''),
      ],
      imageUrl: ImageFile(
          imageUrl:
              "https://bookhouse.kg/media/galleryphoto/2022/9/cab024e3-c8ea-49fe-8b0d-c75ba73221b1.jpg.360x460_q94.jpg"),
      booksType: "Recomended Books",
      booksPage: '192',
      publishedYear: '2017',
      rating: '4.7',
      reviews: '34k'),
  const BooksModel(
      id: "6",
      title: "Поллианна",
      category: 'Bestsellers',
      author: "Элинор Портер",
      description: [
        Description(
            data:
                '''Дүйнөлүк балдар адабиятынын «Алтын казынасына» кирген Поллианна романынын жазылганына жүз жылдан ашты. Анын автору Элинор Портердин эстелигинде «миллиондогон жүрөктөргө жарык чачты» деген жазуу бар. Бир кылымдан бери көптөгөн тилдерге которулуп, окурмандар тарабынан сүйүлүп окулуп келаткан, элдин жүрөгүнөн түнөк тапкан бул чыгарманын сыры эмнеде?
Дүйнөлүк классикалык адабияттардын катарын толуктаган «Поллианна» чыгармасы кыргыз тилинде алгачкы ирет жарык көрүүдө. 
Китеп мектеп окуучуларынан тартып бардык окурмандарга арналат.
'''),
      ],
      imageUrl: ImageFile(
          imageUrl:
              "https://bookhouse.kg/media/galleryphoto/2022/2/4627d0da-8eef-4956-9c4e-256f313f6740.jpg.360x460_q94.jpg"),
      booksPage: '180',
      publishedYear: '2022',
      rating: '4.0',
      reviews: '24k'),
];
